  if (confirm("Баю-баюшки-баю")){
      if (confirm("Не ложися на краю")){
          if (confirm("Придёт серенький волчок")){
              if (confirm("И укусит за бочок")){
                  if (confirm("Понесёт он в кабачок")){
                      if (confirm("И продаст за пятачок")){
                          if (confirm("В кабачке на полочке")){
                              if (confirm("Золотые ложечки")){
                                  if (confirm("А-а-а, баю-баюшки, баю")){
                                      if (confirm("Не уснул?\nНу тогда на,смотри"))
                                          alert("Неожидал?А вот такие вот у нас стандартные проверочки.")
                                  }else{
                                        //ссылка на страницу
                                            }
                              }else{
                                  alert ("Ну теперь сиди.\nРешай, винда в помощь."); 
                                        //код с Жаком Фреско
                                            }
                          }else{
                                //ссылка на страницу
                                    }
                      }else{
                            //ссылка на страницу
                                }
                  }else{
                        //ссылка на страницу
                            }
                  
                }else{
                    //ссылка на страницу
                        }
          }else{
                //ссылка на страницу
                    }
      }else{
            //ссылка на страницу
                }
  }else{
      //ссылка на страницу 
        }